app/views/admins/stats.html.erb

SELECT COUNT(*) FROM "users" WHERE "users"."is_admin" = ? AND (points <= 200 and points > 50)  [["is_admin", false]]
---
  <!-- number of users -->
  <% user_count = User.where(is_admin: false).count %>

SELECT COUNT(*) FROM "reservations" WHERE "reservations"."date" = ?  [["date", "2017-05-30"]]
---
    <% reservations_labels.push(date) %>
    <% reservations_data.push(Reservation.where(date: date).count) %>