app/views/restaurants/show.html.erb


          <%= hidden_field_tag "user_id", User.find_by(username: "mengwang").id %>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "mengwang"], ["LIMIT", 1]]