app/views/restaurants/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
        <% unless session["user_id"].blank? %>
          <% cur_user = User.find_by(id: session["user_id"]) %>