app/controllers/admins_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def stats
    if session["user_id"].blank?
      redirect_to "/login"
    else
      if User.find_by(id: session["user_id"]).is_admin == true