app/controllers/reservations_controller.rb

  def index
    if session["user_id"].blank?
      redirect_to "/login"
    else
      @user = User.find_by(id: session["user_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def canceled
    if session["user_id"].blank?
      redirect_to "/login"
    else
      @user = User.find_by(id: session["user_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def destroy
    reservation = Reservation.find_by(id: params['id'])
    reservation.update(canceled: true)
    user = User.find_by(id: session["user_id"])
    user.update(points: user.points - 10 * reservation.tables.to_i)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reservations" SET "canceled" = ? WHERE "reservations"."id" = ?  [["canceled", true], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "points" = ? WHERE "users"."id" = ?  [["points", 10], ["id", 4]]

  def create
    if session["user_id"].blank?
      redirect_to "/login"
    else
      # we request that the reservation date must be some day after today
      if params["date"] <= Date.today.to_s
        flash[:danger] = "You can only reserve for a date later than today!"
        redirect_to "/restaurants/#{params["restaurant_id"]}"
      else
        # check whether there are enough tables left
        conflict_reservations = Reservation.where(canceled: false).where(date: params["date"], time: params["time"])
        left_tables = Restaurant.find_by(id: params["restaurant_id"]).number_of_tables
        conflict_reservations.each do |r|
          left_tables = left_tables - r.tables
        end

        # if not enough tables
        if left_tables < params["tables"].to_i
          flash[:danger] = "There are #{left_tables} tables left at that time!"
          redirect_to "/restaurants/#{params["restaurant_id"]}"
        # if enough tables
        else
          # save the reservation record
          reservation = Reservation.new
          reservation.user_id = session["user_id"]
          reservation.restaurant_id = params["restaurant_id"]
          reservation.date = params["date"]
          reservation.time = params["time"]
          reservation.tables = params["tables"]
          reservation.save
          # user gain points
          user = User.find_by(id: session["user_id"])
          user.update(points: user.points + 10 * params["tables"].to_i)
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."canceled" = ? AND "reservations"."date" = ? AND "reservations"."time" = ?  [["canceled", false], ["date", "2017-06-06"], ["time", "11:00"]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."date" = ? AND "reservations"."time" = ?  [["date", "2017-06-06"], ["time", "11:00"]]
INSERT INTO "reservations" ("user_id", "restaurant_id", "date", "time", "tables") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["restaurant_id", 2], ["date", "2017-06-06"], ["time", "11:00"], ["tables", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "points" = ? WHERE "users"."id" = ?  [["points", 110], ["id", 4]]

  def new_review
    @reservation = Reservation.find_by(id: params["id"])
    @restaurant = Restaurant.find_by(id: @reservation.restaurant_id)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create_review
    @reservation = Reservation.find_by(id: params["id"])
    @reservation.review = params["review"]
    @reservation.save
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "reservations" SET "review" = ? WHERE "reservations"."id" = ?  [["review", "Good!"], ["id", 9]]

  def show_all
    if session["user_id"].blank?
      redirect_to "/login"
    else
      if User.find_by(id: session["user_id"]).is_admin == true
        @reservations = Reservation.all.order('restaurant_id asc, date desc, time desc')
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" ORDER BY restaurant_id asc, date desc, time desc