app/controllers/reservations_controller.rb

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "reservations" SET "canceled" = ? WHERE "reservations"."id" = ?  [["canceled", true], ["id", 5]]
---
  def delete
    reservation = Reservation.find_by(id: params['id'])
    reservation.update(canceled: true)