app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."restaurant_id" = ? AND ("reservations"."review" IS NOT NULL)  [["restaurant_id", 1]]
---
  def show
    @restaurant = Restaurant.find_by(id: params["id"])
    @reservations = @restaurant.reservations.where.not(review: nil)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @restaurant = Restaurant.find_by(id: params["id"])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "restaurants" SET "number_of_tables" = ? WHERE "restaurants"."id" = ?  [["number_of_tables", 9], ["id", 1]]
---
  def update
    @restaurant = Restaurant.find_by(id: params["id"])
    @restaurant.name = params["name"]
    @restaurant.city = params["city"]
    @restaurant.address = params["address"]
    @restaurant.cuisines = params["cuisines"]
    @restaurant.dining_style = params["dining_style"]
    @restaurant.price_range = params["price_range"]
    @restaurant.phone_number = params["phone_number"]
    @restaurant.website = params["website"]
    @restaurant.description = params["description"]
    @restaurant.photo_url = params["photo_url"]
    @restaurant.number_of_tables = params["number_of_tables"]
    if @restaurant.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def new
    if session["user_id"].blank?
      redirect_to "/login"
    else
      @user = User.find_by(id: session["user_id"])

INSERT INTO "restaurants" ("name", "city", "address", "dining_style", "cuisines", "price_range", "phone_number", "website", "description", "photo_url", "number_of_tables") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @restaurant = Restaurant.new
    @restaurant.name = params["name"]
    @restaurant.city = params["city"]
    @restaurant.address = params["address"]
    @restaurant.cuisines = params["cuisines"]
    @restaurant.dining_style = params["dining_style"]
    @restaurant.price_range = params["price_range"]
    @restaurant.phone_number = params["phone_number"]
    @restaurant.website = params["website"]
    @restaurant.description = params["description"]
    @restaurant.photo_url = params["photo_url"]
    @restaurant.number_of_tables = params["number_of_tables"]
    if @restaurant.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."restaurant_id" = ?  [["restaurant_id", 3]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 9]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 3]]
---
  def destroy
    @restaurant = Restaurant.find_by(id: params["id"])
    # delete the corresponding reservations first
    reservations = Reservation.where(restaurant_id: @restaurant.id)
    reservations.each do |reservation|
      reservation.delete
    end

    if @restaurant.delete

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."restaurant_id" = ? ORDER BY date desc, time desc  [["restaurant_id", 2]]
---
  def show_reservations
    @restaurant = Restaurant.find_by(id: params["id"])
    @reservations = @restaurant.reservations.order('date desc, time desc')