app/controllers/users_controller.rb

  def create
    @user = User.new
    @user.first_name = params["first_name"]
    @user.last_name = params["last_name"]
    @user.username = params["username"]
    @user.password = params["password"]
    @user.email = params["email"]
    if @user.save
---
INSERT INTO "users" ("username", "first_name", "last_name", "email", "password_digest") VALUES (?, ?, ?, ?, ?)  [["username", "wangm123"], ["first_name", "Meng"], ["last_name", "Wang"], ["email", "wangm12@uchicago.edu"], ["password_digest", "$2a$10$zCpct6fH0PB96RCl8kLETuG8A.39mJD1yMD8gSgSRRJn9nunr0FUW"]]

  def index
    if session["user_id"].blank?
      redirect_to "/login"
    else
      @user = User.find_by(id: session["user_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    if session["user_id"].blank?
      redirect_to "/login"
    else
      @user = User.find_by(id: session["user_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    if session["user_id"].blank?
      redirect_to "/login"
    else
      @user = User.find_by(id: session["user_id"])
      @user.password = params["password"]
      @user.email = params["email"]
      if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "email" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$AfDTCTE2uUnestGVHLR5COM9gw3PV.r5plvNkolvF.gcl.IAgYPk6"], ["email", "admin@uchicago.edu"], ["id", 3]]